### Predicting the Survivors of the Titanic Dataset

In [49]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns
from sklearn.linear_model import LogisticRegression 
from sklearn.model_selection import train_test_split

In [70]:
titanic = pd.read_csv("titanic.csv")

In [71]:
to_drop = ["Name", "Ticket", "PassengerId", "Cabin", "Embarked", 
           "Parch", "SibSp", "Fare"]
titanic = titanic.drop(to_drop, axis=1)

In [72]:
titanic = titanic.dropna()

In [73]:
titanic.shape

(714, 4)

In [74]:
X = titanic.drop(["Survived"], axis=1)
y = titanic["Survived"]

In [75]:
print(X.shape, y.shape)

(714, 3) (714,)

In [67]:
X = X.dropna()
X.shape

(714, 3)

In [78]:
X_train, X_test, y_train, y_test = train_test_split(X, y)

In [79]:
print(X_train.shape, X_test.shape, y_train.shape, y_test.shape)

(535, 3) (179, 3) (535,) (179,)

In [86]:
X_train = pd.get_dummies(X_train, drop_first=True)
X_test = pd.get_dummies(X_test, drop_first=True)

In [87]:
X_test

     Pclass   Age  Sex_male
550       1  17.0         1
693       3  25.0         1
124       1  54.0         1
706       2  45.0         0
369       1  24.0         0
..      ...   ...       ...
836       3  21.0         1
402       3  21.0         0
365       3  30.0         1
344       2  36.0         1
759       1  33.0         0

[179 rows x 3 columns]

In [88]:
LR = LogisticRegression()
LR.fit(X_train, y_train)

LogisticRegression()

In [89]:
LR.predict(np.array([[3, 30, 1], [1, 2, 0]]))

array([0, 1])

In [90]:
LR.score(X_test, y_test)

0.776536312849162

In [69]:
y = y.dropna()
y.shape

(891,)

In [47]:
X_train, X_test, y_train, y_test = train_test_split()

In [48]:
titanic_test

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [6]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
to_drop = ["Name", "Ticket", "PassengerId", "Cabin", "Embarked", 
           "Parch", "SibSp", "Fare"]

In [39]:
for df in [titanic_train, titanic_test]:
    df.drop(to_drop, inplace=True, axis=1)

In [45]:
titanic_train.head()

   Survived  Pclass   Age  Sex_male
0         0       3  22.0         1
1         1       1  38.0         0
2         1       3  26.0         0
3         1       1  35.0         0
4         0       3  35.0         1

In [10]:
titanic.head()

   Survived  Pclass     Sex   Age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [41]:
titanic_train = pd.get_dummies(titanic_train, drop_first=True)
titanic_test = pd.get_dummies(titanic_test, drop_first=True)

In [44]:
titanic_test.head()

   Pclass   Age  Sex_male
0       3  34.5         1
1       3  47.0         0
2       2  62.0         1
3       3  27.0         1
4       3  22.0         0

In [43]:
y_train = titanic_train["Survived"]
x_train = titanic_train.drop("Survived", axis=1)
y_test = titanic_test["Survived"]
x_test = titanic_test.drop("Survived", axis=1)

KeyError: 'Survived'

In [20]:
x_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    891 non-null    int64
 1   Age       714 non-null    float64
 2   Sex_male  891 non-null    uint8
dtypes: float64(1), int64(1), uint8(1)
memory usage: 14.9 KB

In [23]:
titanic.shape

(891, 4)

In [24]:
titanicdf = titanic.dropna()

In [26]:
y_train = titanicdf["Survived"]
x_train = titanicdf.drop("Survived", axis=1)

In [27]:
x_train

     Pclass   Age  Sex_male
0         3  22.0         1
1         1  38.0         0
2         3  26.0         0
3         1  35.0         0
4         3  35.0         1
..      ...   ...       ...
885       3  39.0         0
886       2  27.0         1
887       1  19.0         0
889       1  26.0         1
890       3  32.0         1

[714 rows x 3 columns]

In [28]:
LR = LogisticRegression()

In [29]:
LR = LogisticRegression()
LR.fit(x_train, y_train)
LR.predict(np.array([[3, 30, 1], [1, 2, 0]]))

LogisticRegression()

In [35]:
LR.predict(np.array([[3, 30, 1], [1, 2, 0]]))

array([0, 1])